test/stressTest/config.yml
config:
  target: "https://cde.awsprod.nlm.nih.gov"
#  target: "https://cde-qa.nlm.nih.gov"
#  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 250
  payload:
    path: "terms.csv"
    fields:
      - "term"
scenarios:
  - name: "Search and view"
    flow:
      - get:
          url: "/"
#      - get:
#          url: "/system/public/assets/js/vendor-05b1ceda6d.js"
#      - get:
##          url: "/system/public/assets/js/main-a05abbe5e3.js"
#          url: "/system/public/assets/js/main-680761f3af.js"
      - post:
          url: "/elasticSearch/cde"
          json:
              'resultPerPage': 20
              'selectedOrg': ''
              'searchTerm': '{{ term }}'
              'selectedElements':
                - ''
              'selectedElementsAlt':
                - ''
              'page': 1
              'includeAggregations': true
              'selectedStatuses':
                - 'Preferred Standard'
                - 'Standard'
                - 'Qualified'
              'selectedDatatypes':
                - ''
              'searchToken': 'idecb7b901ab572'
          capture:
            json: "$.cdes[0].tinyId"
            as: "cdeId"
      - get:
          url: "/deView?tinyId={{ cdeId }}"